#Область ПрограммныйИнтерфейс
 

//ВКМ - Через регламентное задание, которое будет обходить элементы справочника УведомленияТелеграмБоту, 
//ВКМ -отправлять и после успешной отправки удалять элементы справочника
Процедура ВКМ_ОтправитьУведомленияВТелеграм() Экспорт

	Токен = Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить();
	ИДЧата = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить();

	Если Не ЗначениеЗаполнено(Токен) Или Не ЗначениеЗаполнено(ИДЧата) Тогда
		
		ВКМ_ФиксироватьОшибкуОтправкиТелеграм("Не все настройки для подключения к Телеграм-боту заполнены!");
		Возврат;
		
	КонецЕсли;

	Выборка = ВКМ_ПолучитьУведомленияДляОтправки();

	Пока Выборка.Следующий() Цикл

		Ответ = ВКМ_ОтправкаТелеграмСообщения(Выборка.ВКМ_ТекстСообщения, Токен, ИДЧата);

		Если Ответ <> Неопределено И Ответ.КодСостояния = 200 Тогда

			Попытка
				УведомлениеОбъект = Выборка.Ссылка.ПолучитьОбъект();
				Если УведомлениеОбъект <> Неопределено Тогда
					УведомлениеОбъект.Удалить();
				КонецЕсли;
			Исключение
				ВКМ_ФиксироватьОшибкуОтправкиТелеграм("Уведомление неудалено: " + ОписаниеОшибки());
			КонецПопытки;
		ИначеЕсли Ответ <> Неопределено Тогда
			ОписаниеОшибкиAPI = Ответ.ПолучитьТелоКакСтроку();
			ВКМ_ФиксироватьОшибкуОтправкиТелеграм("Ошибка API: " + ОписаниеОшибкиAPI);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//ВКМ -  Выполняет отправку сообщения через Telegram Bot API
Функция ВКМ_ОтправкаТелеграмСообщения(Знач ТекстСообщения, Знач Токен, Знач ИДЧата)

	Перем Соединение, HTTPЗапрос, Ответ;

	Попытка 

		Защита = ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение();
		Соединение = Новый HTTPСоединение("api.telegram.org", , , , , 10, Защита);
		
		Данные = Новый Структура("chat_id, text", ИДЧата, ТекстСообщения);

		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, Данные);
		ТелоЗапроса = ЗаписьJSON.Закрыть();

		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");

		URL = СтрШаблон("/bot%1/sendMessage", Токен);
		HTTPЗапрос = Новый HTTPЗапрос(URL, Заголовки);
		HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса, КодировкаТекста.UTF8);
		
		Ответ = Соединение.ОтправитьЗапрос(HTTPЗапрос);

		Возврат Ответ;

	Исключение
		ВКМ_ФиксироватьОшибкуОтправкиТелеграм("Ошибка отправки сообщения: " + ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;

КонецФункции

//ВКМ - Перечень сообщений для отправки
Функция ВКМ_ПолучитьУведомленияДляОтправки()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_УведомленияТелеграмБоту.Ссылка КАК Ссылка,
	|	ВКМ_УведомленияТелеграмБоту.ВКМ_ТекстСообщения КАК ВКМ_ТекстСообщения
	|ИЗ
	|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту";

	Результат = Запрос.Выполнить().Выбрать();
	Возврат Результат;

КонецФункции

//ВКМ -  Логирование ошибок
Процедура ВКМ_ФиксироватьОшибкуОтправкиТелеграм(СообщениеОбОшибке)
	ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
		"ВКМ_Телеграмм.Отправка", УровеньЖурналаРегистрации.Ошибка, , , СообщениеОбОшибке);
КонецПроцедуры

#КонецОбласти