#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОписаниеПеременных

// Переменные для хранения состояния документа до записи
Перем ВКМ_НовыйДокумент;
Перем ВКМ_ИсходныеДанные;

#КонецОбласти

#Область ОбработчикиСобытий

//ВКМ - Проверка: создание нового документа или изменение старого 
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ВКМ_НовыйДокумент = ЭтоНовый();
	
	//ВКМ - Фиксируем исходные данные документа, при его редактировании
	Если Не ВКМ_НовыйДокумент Тогда
		ВКМ_ИсходныеДанные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
								Ссылка, "Специалист, ДатаПроведенияРабот, ВремяНачалаРабот, ВремяОкончанияРабот");
	КонецЕсли;
	
КонецПроцедуры

// 2. РЕГИСТРАЦИЯ УВЕДОМЛЕНИЯ (Срабатывает ПОСЛЕ успешной записи в БД)
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Уведомить = Ложь;
	Текст   = "";
	
	Если ВКМ_НовыйДокумент Тогда
		Уведомить = Истина;
		Текст   = "Назначена новая заявка.";
	ИначеЕсли ВКМ_ИсходныеДанные <> Неопределено Тогда
		
		Если Специалист <> ВКМ_ИсходныеДанные.Специалист 
			Или ДатаПроведенияРабот <> ВКМ_ИсходныеДанные.ДатаПроведенияРабот
			Или ВремяНачалаРабот <> ВКМ_ИсходныеДанные.ВремяНачалаРабот
			Или ВремяОкончанияРабот <> ВКМ_ИсходныеДанные.ВремяОкончанияРабот Тогда
			
			Уведомить = Истина;
			Текст   = "Параметры заявки (дата/время/специалист) изменены.";
		КонецЕсли;
	КонецЕсли;
	
	Если Уведомить Тогда
		ВКМ_ЗаписатьВСправочникУведомлений(Текст);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//ВКМ - Проверка на корректность даты документа и типа указанного договора (По заданию сказано реализовать это в обработке проведения).
	
	ИнформацияОДоговоре = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор,"ВидДоговора, ВКМ_ДатаНачала, ВКМ_ДатаОкончания, ВКМ_СтоимостьЧасаРаботы");
	Абонентскийдоговор = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание");
	Если НЕ ИнформацияОДоговоре.ВидДоговора = Абонентскийдоговор Тогда
		ОбщегоНазначения.СообщитьПользователю(
				"Выбранный договор не является договором абонентского обслуживания. Проведение невозможно!", , "Договор", , Отказ);
	КонецЕсли;
	
	
			
	Если ИнформацияОДоговоре.ВидДоговора = Абонентскийдоговор И 
		(Дата < ИнформацияОДоговоре.ВКМ_ДатаНачала Или Дата > ИнформацияОДоговоре.ВКМ_ДатаОкончания) Тогда
			ТекстОшибки = СтрШаблон("Дата документа не соответствует периоду действия договора (%1 - %2)!", 
				Формат(ИнформацияОДоговоре.ВКМ_ДатаНачала, "ДЛФ=D"), 
				Формат(ИнформацияОДоговоре.ВКМ_ДатаОкончания, "ДЛФ=D"));
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "Дата", , Отказ);
		КонецЕсли;

	
	//ВКМ - Запись движений
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Очистить();
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка КАК Ссылка,
		|	СУММА(ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ЧасыКОплатеКлиенту) КАК ЧасыКОплатеКлиенту,
		|	ВКМ_ОбслуживаниеКлиента.Дата КАК Дата,
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_ДатаНачала КАК ДоговорВКМ_ДатаНачала,
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_ДатаОкончания КАК ДоговорВКМ_ДатаОкончания,
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВидДоговора КАК ДоговорВидДоговора
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|		ПО ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка = ВКМ_ОбслуживаниеКлиента.Ссылка
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка,
		|	ВКМ_ОбслуживаниеКлиента.Дата,
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВидДоговора,
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_ДатаНачала,
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_ДатаОкончания";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДвижениеКлиент = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		ДвижениеКлиент.Период = Дата;
		ДвижениеКлиент.Клиент = Клиент;
		ДвижениеКлиент.Договор = Договор;
		ДвижениеКлиент.КоличествоЧасов = ВыборкаДетальныеЗаписи.ЧасыКОплатеКлиенту;
		ДвижениеКлиент.СуммаКОплате = ВыборкаДетальныеЗаписи.ЧасыКОплатеКлиенту * ИнформацияОДоговоре.ВКМ_СтоимостьЧасаРаботы;
	КонецЦикла;
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//ВКМ - Запись изменений по документу в справочник
Процедура ВКМ_ЗаписатьВСправочникУведомлений(Текст)
	
	ШаблонСообщения = "%1
	|----------------------------------
	|Специалист: %2
	|**********************************
	|Клиент: %3
	|**********************************	
	|Дата: %4
	|**********************************
	|Время начала работ: 	 %5 
	|**********************************
	|Время окончания работ:  %6
	|----------------------------------";
	
	ТекстСообщения = СтрШаблон(ШаблонСообщения,
		Текст, Строка(Специалист), Строка(Клиент),
		Формат(ДатаПроведенияРабот, "ДЛФ=D"),
		Формат(ВремяНачалаРабот, "ДЛФ=T"),
		Формат(ВремяОкончанияРабот, "ДЛФ=T"));
		
	НовоеУведомление = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
	НовоеУведомление.ВКМ_ТекстСообщения = ТекстСообщения;
	НовоеУведомление.Записать();
	
КонецПроцедуры

#КонецОбласти
#КонецЕсли