#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура МассовоеСозданиеРеализацииТоваровИУслуг(Период) Экспорт
	
	НачалоПериода = НачалоМесяца(Период);
	КонецПериода  = КонецМесяца(Период);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Договоры.Ссылка КАК Договор,
		|	Договоры.Владелец КАК Контрагент,
		|	Договоры.Организация КАК Организация,
		|	ЕСТЬNULL(Реализации.Ссылка, ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) КАК ДокументОРеализацииУжеЕсть
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК Договоры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Реализации
		|		ПО Договоры.Ссылка = Реализации.Договор
		|		И Реализации.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|		И НЕ Реализации.ПометкаУдаления
		|ГДЕ
		|	НЕ Договоры.ПометкаУдаления
		|	И Договоры.ВидДоговора = &ВидДоговора
		|	И Договоры.ВКМ_ДатаНачала <= &КонецПериода
		|	И (Договоры.ВКМ_ДатаОкончания >= &НачалоПериода
		|	ИЛИ Договоры.ВКМ_ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Количество = Выборка.Количество();
	Счетчик = 0;
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.ДокументОРеализацииУжеЕсть) Тогда
			ДокументОбъект = Выборка.ДокументОРеализацииУжеЕсть.ПолучитьОбъект();
			Если ДокументОбъект.Комментарий
				<> "Документ создан обработкой массового создания документов реализации товаров и услуг!" Тогда
				ДокументОбъект.Комментарий = "Документ изменен обработкой массового создания документов реализации товаров и услуг!";
			КонецЕсли;

		Иначе
			ДокументОбъект = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			ДокументОбъект.Дата = КонецПериода;
			ДокументОбъект.Организация = Выборка.Организация;
			ДокументОбъект.Контрагент = Выборка.Контрагент;
			ДокументОбъект.Договор = Выборка.Договор;
			ДокументОбъект.Комментарий = "Документ создан обработкой массового создания документов реализации товаров и услуг!";
			ДокументОбъект.Ответственный = Пользователи.ТекущийПользователь();
		КонецЕсли;

		ДокументОбъект.ВКМ_ВыполнитьАвтозаполнение();
		
		Если ДокументОбъект.ПроверитьЗаполнение() И ДокументОбъект.Услуги.Количество() > 0 Тогда
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		
		Счетчик = Счетчик + 1;
		ДлительныеОперации.СообщитьПрогресс(Счетчик/Количество * 100);
		
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли