#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

//ВКМ - Расчет и проведение окладов с отпусками

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

    СформироватьДвижения();
    
    РассчитатьОклад();
    
    РассчитатьОтпуск();
    
    РассчитатьУдержания();
    
    ДвиженияВзаиморасчетыССотрудниками();
    
    ДвиженияУчетОтпускаСотрудников();



КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Для Каждого ТекущаяСтрока Из НачисленияЗаработнойПлаты Цикл
		Если ТекущаяСтрока.ДатаНачала > ТекущаяСтрока.ДатаОкончания Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Дата начала не может быть больше даты окончания!Строка -  №%1",
				ТекущаяСтрока.НомерСтроки));
			Отказ = Истина;
		КонецЕсли;

		Если ТекущаяСтрока.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФиксированнаяПремия Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("В строке №%1 не верный вид расчета", ТекущаяСтрока.НомерСтроки));
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвижения()

	Движения.ВКМ_ОсновныеНачисления.Записывать = Истина;
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	Движения.ВКМ_Удержания.Записывать = Истина;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	ВКМ_НачислениеЗарплатыНачисленияЗП.Сотрудник КАК Сотрудник,
				   |	ВКМ_НачислениеЗарплатыНачисленияЗП.ВидРасчета КАК ВидРасчета,
				   |	ВКМ_НачислениеЗарплатыНачисленияЗП.ДатаНачала КАК ДатаНачала,
				   |	ВКМ_НачислениеЗарплатыНачисленияЗП.ДатаОкончания КАК ДатаОкончания,
				   |	ВКМ_НачислениеЗарплатыНачисленияЗП.ГрафикРаботы КАК ГрафикРаботы
				   |ПОМЕСТИТЬ ВТ_Док
				   |ИЗ
				   |	Документ.ВКМ_НачислениеЗарплаты.НачисленияЗаработнойПлаты КАК ВКМ_НачислениеЗарплатыНачисленияЗП
				   |ГДЕ
				   |	ВКМ_НачислениеЗарплатыНачисленияЗП.Ссылка = &Ссылка
				   |СГРУППИРОВАТЬ ПО
				   |	ВКМ_НачислениеЗарплатыНачисленияЗП.Сотрудник,
				   |	ВКМ_НачислениеЗарплатыНачисленияЗП.ВидРасчета,
				   |	ВКМ_НачислениеЗарплатыНачисленияЗП.ДатаНачала,
				   |	ВКМ_НачислениеЗарплатыНачисленияЗП.ДатаОкончания,
				   |	ВКМ_НачислениеЗарплатыНачисленияЗП.ГрафикРаботы
				   |;
				   |
				   |ВЫБРАТЬ
				   |	ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник КАК Сотрудник,
				   |	ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеОборот КАК СуммаКОплатеОборот
				   |ПОМЕСТИТЬ ВТ_ВыполненныеРаботы
				   |ИЗ
				   |	РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&ДатаНачало, &ДатаОкончание,,) КАК
				   |		ВКМ_ВыполненныеСотрудникомРаботыОбороты
				   |;
				   |ВЫБРАТЬ
				   |	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
				   |	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот
				   |ПОМЕСТИТЬ ВТ_Процент
				   |ИЗ
				   |	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата,) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
				   |;
				   |
				   |ВЫБРАТЬ
				   |	ВТ_Док.Сотрудник КАК Сотрудник,
				   |	ВТ_Док.ВидРасчета КАК ВидРасчета,
				   |	ВТ_Док.ДатаНачала КАК ДатаНачала,
				   |	ВТ_Док.ДатаОкончания КАК ДатаОкончания,
				   |	ВТ_Док.ГрафикРаботы КАК ГрафикРаботы,
				   |	ВТ_Процент.ПроцентОтРабот КАК ПроцентОтРабот,
				   |	ВТ_ВыполненныеРаботы.СуммаКОплатеОборот КАК СуммаКОплате
				   |ИЗ
				   |	ВТ_Док КАК ВТ_Док
				   |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыполненныеРаботы КАК ВТ_ВыполненныеРаботы
				   |		ПО ВТ_Док.Сотрудник = ВТ_ВыполненныеРаботы.Сотрудник
				   |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Процент КАК ВТ_Процент
				   |		ПО ВТ_Док.Сотрудник = ВТ_Процент.Сотрудник";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ДатаНачало", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("ДатаОкончание", КонецМесяца(Дата));

	Результат = Запрос.Выполнить().Выбрать();

	Пока Результат.Следующий() Цикл

		Если ТипЗнч(Результат.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ВКМ_ОсновныеНачисления") Тогда

			Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
			Движение.ПериодРегистрации = НачалоМесяца(ПериодРегистрации);
			Движение.ПериодДействияНачало = Результат.ДатаНачала;
			Движение.ПериодДействияКонец = КонецДня(Результат.ДатаОкончания);
			Движение.ВидРасчета = Результат.ВидРасчета;
			Движение.Сотрудник = Результат.Сотрудник;
			Движение.ГрафикРаботы = Результат.ГрафикРаботы;
			
				Если НЕ ЗначениеЗаполнено(Движение.ГрафикРаботы) Тогда
    	
    				Движение.ГрафикРаботы = Справочники.ВКМ_ГрафикРаботы.НайтиПоНаименованию("Пятидневка");
    				
				КонецЕсли;

			Если Результат.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда

				Движение.БазовыйПериодНачало = НачалоМесяца(ДобавитьМесяц(Результат.ДатаНачала, -12));
				Движение.БазовыйПериодКонец = КонецМесяца(ДобавитьМесяц(Результат.ДатаОкончания, -1));
			КонецЕсли;
		КонецЕсли;

		Если ТипЗнч(Результат.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ВКМ_ДополнительныеНачисления") Тогда
			Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
			Движение.ПериодРегистрации = НачалоМесяца(ПериодРегистрации);
			Движение.ВидРасчета = Результат.ВидРасчета;
			Движение.Сотрудник = Результат.Сотрудник;
			Движение.ПроцентПремии = Результат.ПроцентОтРабот;
			Движение.Результат = Результат.СуммаКОплате;
		КонецЕсли;

	КонецЦикла;

	СформироватьДвиженияУдержания();

	Движения.ВКМ_ОсновныеНачисления.Записать();

	Движения.ВКМ_ДополнительныеНачисления.Записать();

	Движения.ВКМ_Удержания.Записать();

КонецПроцедуры

Процедура СформироватьДвиженияУдержания()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВКМ_НачислениеЗарплатыНачисленияЗП.Сотрудник
	|ИЗ
	|	Документ.ВКМ_НачислениеЗарплаты.НачисленияЗаработнойПлаты КАК ВКМ_НачислениеЗарплатыНачисленияЗП
	|ГДЕ
	|	ВКМ_НачислениеЗарплатыНачисленияЗП.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_НачислениеЗарплатыНачисленияЗП.Сотрудник";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Результат = Запрос.Выполнить().Выбрать();

	Пока Результат.Следующий() Цикл
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.ПериодРегистрации = ПериодРегистрации;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Движение.Сотрудник = Результат.Сотрудник;
		Движение.БазовыйПериодНачало = НачалоМесяца(ПериодРегистрации);
		Движение.БазовыйПериодКонец = КонецМесяца(ПериодРегистрации);
	КонецЦикла;

КонецПроцедуры

Процедура РассчитатьОклад()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки,
				   |	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия, 0) КАК РабочихЧасов,
				   |	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК ОтработаноЧасов,
				   |	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад КАК Оклад
				   |ИЗ
				   |	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(Регистратор = &Ссылка
				   |	И ВидРасчета = &ВидРасчета) КАК ВКМ_ОсновныеНачисленияДанныеГрафика
				   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период, Сотрудник В
				   |			(ВЫБРАТЬ
				   |				ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник
				   |			ИЗ
				   |				РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
				   |			ГДЕ
				   |				ВКМ_ОсновныеНачисления.Регистратор = &Ссылка
				   |				И ВКМ_ОсновныеНачисления.ВидРасчета = &ВидРасчета)) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
				   |		ПО ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
	Запрос.УстановитьПараметр("Период", Дата);

	Результат = Запрос.Выполнить().Выбрать();

	Пока Результат.Следующий() Цикл

		Если Результат.РабочихЧасов = 0 Тогда
			ОбщегоНазначения.СообщитьПользователю("Не заполнен график работы!");
			Прервать;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Результат.Оклад)  Тогда
			ОбщегоНазначения.СообщитьПользователю("У сотрудника не указан оклад!");
			Прервать;
		КонецЕсли;

		Движение = Движения.ВКМ_ОсновныеНачисления[Результат.НомерСтроки - 1];
										
		Если Результат.РабочихЧасов <> 0 Тогда
			Движение.Результат = Результат.Оклад / Результат.РабочихЧасов * Результат.ОтработаноЧасов;
		Иначе
			Движение.Результат = 0;
		КонецЕсли;
		
		Движение.ОтработаноЧасов = Результат.ОтработаноЧасов;
		Движение.Оклад = Результат.Оклад;
		Движение.РабочихЧасов = Результат.РабочихЧасов;

	КонецЦикла;

	Движения.ВКМ_ОсновныеНачисления.Записать( , Истина);

КонецПроцедуры

Процедура РассчитатьОтпуск()

	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
	|	ВКМ_ОсновныеНачисления.ПериодДействияНачало КАК ТекНачало,
	|	ВКМ_ОсновныеНачисления.ПериодДействияКонец КАК ТекКонец,
	|	ЕСТЬNULL(ВТ_ДополнительныеНачисления.РезультатБаза, 0) КАК ДопРезультатБаза,
	|	ЕСТЬNULL(ВТ_ОсновныеНачисления.РезультатБаза, 0) КАК ОснРезультатБаза,
	|	ЕСТЬNULL(ВТ_ОсновныеНачисления.ОтработаноЧасовБаза, 0) КАК ОтработаноЧасовБаза
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ДополнительныеНачисления(&Измерения,
	|			&Измерения,,) КАК ВТ_ДополнительныеНачисления
	|		ПО ВКМ_ОсновныеНачисления.НомерСтроки = ВТ_ДополнительныеНачисления.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ОсновныеНачисления(&Измерения, &Измерения,,) КАК
	|			ВТ_ОсновныеНачисления
	|		ПО ВКМ_ОсновныеНачисления.НомерСтроки = ВТ_ОсновныеНачисления.НомерСтроки
	|ГДЕ
	|	ВКМ_ОсновныеНачисления.ВидРасчета = &Отпуск
	|	И ВКМ_ОсновныеНачисления.Регистратор = &Ссылка";

	МассивИзмерений = Новый Массив;
	МассивИзмерений.Добавить("Сотрудник"); 

	Запрос.УстановитьПараметр("Отпуск", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.УстановитьПараметр("Измерения", МассивИзмерений);

	РезультатЗапроса = Запрос.Выполнить().Выбрать();

	Пока РезультатЗапроса.Следующий() Цикл

		Движение = Движения.ВКМ_ОсновныеНачисления[РезультатЗапроса.НомерСтроки - 1];
		
		Если РезультатЗапроса.ОтработаноЧасовБаза = 0 Тогда
            ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Нет данных о базе (часы) для расчета отпуска в строке %1", РезультатЗапроса.НомерСтроки));
            Продолжить;
		КонецЕсли;
		
		ДнейОтработаноВБазе = РезультатЗапроса.ОтработаноЧасовБаза / 8;
		ДнейОтпуска = (НачалоДня(РезультатЗапроса.ТекКонец) - НачалоДня(РезультатЗапроса.ТекНачало)) / 86400 + 1;
		
		Движение.Результат = (РезультатЗапроса.ОснРезультатБаза + РезультатЗапроса.ДопРезультатБаза) / ДнейОтработаноВБазе * ДнейОтпуска;

	КонецЦикла;

	Движения.ВКМ_ОсновныеНачисления.Записать( , Истина);



КонецПроцедуры

Процедура РассчитатьУдержания()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	ВКМ_Удержания.НомерСтроки,
				   |	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.РезультатБаза КАК ОснРезультатБаза
				   |ПОМЕСТИТЬ ВТ_ОснУдерж
				   |ИЗ
				   |	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
				   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания.БазаВКМ_ОсновныеНачисления(&Измерения, &Измерения, &Разрезы,
				   |			Регистратор = &Регистратор
				   |		И ВидРасчета = &ВидРасчета) КАК ВКМ_УдержанияБазаВКМ_ОсновныеНачисления
				   |		ПО ВКМ_Удержания.НомерСтроки = ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.НомерСтроки
				   |ГДЕ
				   |	ВКМ_Удержания.Регистратор = &Регистратор
				   |	И ВКМ_Удержания.ВидРасчета = &ВидРасчета
				   |	И ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.РегистраторРазрез = &Регистратор
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	ВКМ_Удержания.НомерСтроки,
				   |	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.РезультатБаза КАК ДопРезультатБаза
				   |ПОМЕСТИТЬ ВТ_ДопУдерж
				   |ИЗ
				   |	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
				   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания.БазаВКМ_ДополнительныеНачисления(&Измерения, &Измерения, &Разрезы,
				   |			Регистратор = &Регистратор
				   |		И ВидРасчета = &ВидРасчета) КАК ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления
				   |		ПО ВКМ_Удержания.НомерСтроки = ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.НомерСтроки
				   |ГДЕ
				   |	ВКМ_Удержания.Регистратор = &Регистратор
				   |	И ВКМ_Удержания.ВидРасчета = &ВидРасчета
				   |	И
				   |		ТИПЗНАЧЕНИЯ(ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.РегистраторРазрез) <> ТИП(Документ.ВКМ_НачислениеФиксированнойПремии)
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	ВТ_ОснУдерж.НомерСтроки,
				   |	ЕСТЬNULL(ВТ_ОснУдерж.ОснРезультатБаза, 0) КАК ОснРезультатБаза,
				   |	ЕСТЬNULL(ВТ_ДопУдерж.ДопРезультатБаза, 0) КАК ДопРезультатБаза
				   |ИЗ
				   |	ВТ_ОснУдерж КАК ВТ_ОснУдерж
				   |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДопУдерж КАК ВТ_ДопУдерж
				   |		ПО ВТ_ОснУдерж.НомерСтроки = ВТ_ДопУдерж.НомерСтроки";
	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");

	Разрезы = Новый Массив;
	Разрезы.Добавить("Регистратор");

	Запрос.УстановитьПараметр("Измерения", Измерения);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ВКМ_Удержания.НДФЛ);
	Запрос.УстановитьПараметр("Разрезы", Разрезы);

	Результат = Запрос.Выполнить().Выбрать();

	Пока Результат.Следующий() Цикл

		Движение = Движения.ВКМ_Удержания[Результат.НомерСтроки - 1];
		Движение.Результат = (Результат.ОснРезультатБаза + Результат.ДопРезультатБаза) * 13 / 100;

	КонецЦикла;

	Движения.ВКМ_Удержания.Записать( , Истина);

КонецПроцедуры

Процедура ДвиженияВзаиморасчетыССотрудниками()

	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
"ВЫБРАТЬ
|	ВТ_ВсеНачисления.Сотрудник КАК Сотрудник,
|	СУММА(ВТ_ВсеНачисления.Результат) КАК ОбщаяСумма
|ПОМЕСТИТЬ ВТ_Итого
|ИЗ
|	(ВЫБРАТЬ
|		Сотрудник,
|		Результат
|	ИЗ
|		РегистрРасчета.ВКМ_ОсновныеНачисления
|	ГДЕ
|		Регистратор = &Регистратор
|
|	ОБЪЕДИНИТЬ ВСЕ
|
|	ВЫБРАТЬ
|		Сотрудник,
|		Результат
|	ИЗ
|		РегистрРасчета.ВКМ_ДополнительныеНачисления
|	ГДЕ
|		Регистратор = &Регистратор) КАК ВТ_ВсеНачисления
|
|СГРУППИРОВАТЬ ПО
|	ВТ_ВсеНачисления.Сотрудник
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ВТ_Итого.Сотрудник КАК Сотрудник,
|	ВТ_Итого.ОбщаяСумма КАК СуммаНаРуки
|ИЗ
|	ВТ_Итого КАК ВТ_Итого";


    Запрос.УстановитьПараметр("Регистратор", Ссылка);
    
    Результат = Запрос.Выполнить().Выбрать();
    
    Пока Результат.Следующий() Цикл
        
        Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
        Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
        Движение.Период      = Дата;
        Движение.Сотрудник   = Результат.Сотрудник;              
        
        Движение.Сумма = Окр(Результат.СуммаНаРуки * 0.87, 2);
        
    КонецЦикла;

КонецПроцедуры

Процедура ДвиженияУчетОтпускаСотрудников() 

	Движения.ВКМ_УчетОтпусков.Записывать = Истина;
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_НачислениеЗарплатыНачисленияЗП.Сотрудник КАК Сотрудник,
	|	ВКМ_НачислениеЗарплатыНачисленияЗП.ДатаОкончания КАК ДатаОкончания,
	|	РАЗНОСТЬДАТ(ВКМ_НачислениеЗарплатыНачисленияЗП.ДатаНачала, ВКМ_НачислениеЗарплатыНачисленияЗП.ДатаОкончания, ДЕНЬ) +
	|		1 КАК КоличествоДней
	|ИЗ
	|	Документ.ВКМ_НачислениеЗарплаты.НачисленияЗаработнойПлаты КАК ВКМ_НачислениеЗарплатыНачисленияЗП
	|ГДЕ
	|	ВКМ_НачислениеЗарплатыНачисленияЗП.Ссылка = &Ссылка
	|	И ВКМ_НачислениеЗарплатыНачисленияЗП.ВидРасчета = &ВидРасчета";
	
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		Движение = Движения.ВКМ_УчетОтпусков.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход; 
		Движение.Период = Результат.ДатаОкончания;
		Движение.Сотрудник = Результат.Сотрудник;
		Движение.Значение = Результат.КоличествоДней;
	КонецЦикла;	
	
КонецПроцедуры
#КонецОбласти
#КонецЕсли
