#Область ОбработчикиКомандФормы

// ВКМ - Заполнение рабочего графика 

&НаКлиенте
Процедура ЗаполнитьГрафикРаботы(Команда) Экспорт
	
	Если Не ЗначениеЗаполнено(Объект.ГрафикРаботы) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Выберите график работы!'"));
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Период) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Выберите период!'"));
		Возврат;
	КонецЕсли;
	
	ЗаполнитьГрафикРаботыНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьГрафикРаботыНаСервере()
	
	ДатаНачала = НачалоМесяца(Объект.Период);
	ДатаКонца  = КонецМесяца(Объект.Период);
	
	
	ТекущаяДата = ДатаНачала;
	
	Пока ТекущаяДата <= ДатаКонца Цикл
		
		МенеджерЗаписи = РегистрыСведений.ВКМ_ГрафикРаботы.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ГрафикРаботы = Объект.ГрафикРаботы;
		МенеджерЗаписи.Дата = ТекущаяДата;
		
		НомерДняНедели = ДеньНедели(ТекущаяДата);
		
		Если Объект.Выходные Тогда

			Если НомерДняНедели >= 6 Тогда
				ЭтоВыходной = Истина;
			Иначе
				ЭтоВыходной = Ложь;
			КонецЕсли;

		Иначе

			Если НомерДняНедели = 7 Тогда
				ЭтоВыходной = Истина;
			Иначе
				ЭтоВыходной = Ложь;
			КонецЕсли;

		КонецЕсли;
		
		
		
		МенеджерЗаписи.Выходной = ЭтоВыходной;
		
		Если ЭтоВыходной Тогда
			МенеджерЗаписи.Значение = 0;
		Иначе
			МенеджерЗаписи.Значение = 8;
		КонецЕсли;
		
		МенеджерЗаписи.Записать();
		
		ТекущаяДата = ТекущаяДата + 86400;
		
	КонецЦикла;
	
	ТекстГрафика = Строка(Объект.ГрафикРаботы);
	ТекстПериода = Формат(ДатаНачала, "ДФ='MMMM yyyy'");
	ТекстСообщения = СтрШаблон(НСтр("ru = 'График ""%1"" на %2 заполнен.'"), ТекстГрафика, ТекстПериода);
		
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
КонецПроцедуры

#КонецОбласти

