#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ПериодПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СоздатьДокументыРеализацииТоваровИУслуг(Команда)

	ДлительнаяОперация = СоздатьДокументыРеализацииТоваровИУслугНаСервере();
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультат", ЭтотОбъект);
	ОповещениеОПрогрессе = Новый ОписаниеОповещения("ТекущийПрогресс", ЭтотОбъект);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ОповещениеОПрогрессеВыполнения = ОповещениеОПрогрессе;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


&НаКлиенте
Процедура ОбработатьРезультат(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	ИначеЕсли Результат.Статус = "Внимание!!! => Ошибка!" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	ПериодПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийПрогресс(Прогресс, ДополнительныеПараметры) Экспорт
	
	Если Прогресс.Прогресс <> Неопределено Тогда
		Состояние("Создание документов по реализации товаров и услуг", Прогресс.Прогресс.Процент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СоздатьДокументыРеализацииТоваровИУслугНаСервере()
	
    ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
    
    Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения,
        "Обработки.ВКМ_МассовоеСозданиеАктов.МассовоеСозданиеРеализацииТоваровИУслуг",
        Объект.Период); 
КонецФункции

&НаСервере
Процедура ПериодПриИзмененииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Договоры.Ссылка КАК Договор
		|ПОМЕСТИТЬ ВТ_ДействующиеДоговоры
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК Договоры
		|ГДЕ
		|	НЕ Договоры.ПометкаУдаления
		|	И Договоры.ВидДоговора = &ВидДоговора
		|	И Договоры.ВКМ_ДатаНачала <= &ОкончаниеПериода
		|	И (Договоры.ВКМ_ДатаОкончания >= &НачалоПериода
		|	ИЛИ Договоры.ВКМ_ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Договор КАК Договор,
		|	Реализации.Ссылка КАК РеализацияУслуг
		|ИЗ
		|	ВТ_ДействующиеДоговоры КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Реализации
		|		ПО ВТ.Договор = Реализации.Договор
		|		И Реализации.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|		И НЕ Реализации.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Объект.Период));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецМесяца(Объект.Период));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Объект.Реализация.Очистить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = Объект.Реализация.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти