#Область ОбработчикиСобытийФормы

//ВКМ - Создание команды на форме и ее размещение (Заполнение табличной части сотрудниками)

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИмяКоманды = "ЗаполнитьСотрудников";
	КомандаЗаполнения = Команды.Добавить(ИмяКоманды);
	КомандаЗаполнения.Действие  = "ЗаполнитьСотрудниковНаКлиенте";
	КомандаЗаполнения.Заголовок = "Заполнить сотрудников";
	
	ЭлементПанель = Элементы.НачисленияЗаработнойПлатыКоманднаяПанель; 
	НоваяКнопка = Элементы.Добавить("КнопкаЗаполнитьСотрудников", Тип("КнопкаФормы"), ЭлементПанель);
	НоваяКнопка.ИмяКоманды = ИмяКоманды;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНачисленияЗаработнойПлаты
&НаКлиенте
Процедура НачисленияЗаработнойПлатыВидРасчетаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	МассивРазрешенных = Новый Массив;
	МассивРазрешенных.Добавить(ПредопределенноеЗначение("ПланВидовРасчета.ВКМ_ОсновныеНачисления.Оклад"));
	МассивРазрешенных.Добавить(ПредопределенноеЗначение("ПланВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск"));
	МассивРазрешенных.Добавить(ПредопределенноеЗначение("ПланВидовРасчета.ВКМ_ДополнительныеНачисления.ПремияПроцентом"));
	
	ПараметрОтбора = Новый ПараметрВыбора("Отбор.Ссылка", МассивРазрешенных);
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(ПараметрОтбора);
	
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьСотрудниковНаКлиенте(Команда) Экспорт
	ЗаполнитьСотрудниковНаСервере();
КонецПроцедуры

//ВКМ - Получаем список сотрудников для оклада и для премий, затем указываем графики для окладов
&НаСервере
Процедура ЗаполнитьСотрудниковНаСервере()
	
	Объект.НачисленияЗаработнойПлаты.Очистить();
	
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист,
		|	ВКМ_ОбслуживаниеКлиента.Ссылка КАК ОбслуживаниеКлиента
		|ПОМЕСТИТЬ ВТ_ПроцентОтРабот
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ГОД(ВКМ_ОбслуживаниеКлиента.Дата) = ГОД(&Дата)
		|	И МЕСЯЦ(ВКМ_ОбслуживаниеКлиента.Дата) = МЕСЯЦ(&Дата)
		|	И ВКМ_ОбслуживаниеКлиента.Проведен
		|	И НЕ ВКМ_ОбслуживаниеКлиента.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала КАК ДатаНачала,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТ_ДанныеОтпусков
		|ИЗ
		|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
		|ГДЕ
		|	(МЕСЯЦ(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала) = МЕСЯЦ(&Дата)
		|	И ГОД(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала) = ГОД(&Дата)
		|	ИЛИ МЕСЯЦ(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания) = МЕСЯЦ(&Дата)
		|	И ГОД(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания) = ГОД(&Дата))
		|	И ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад КАК Оклад,
		|	ЕСТЬNULL(ВТ_ДанныеОтпусков.ДатаНачала, НЕОПРЕДЕЛЕНО) КАК ДатаНачалаОтпуска,
		|	ЕСТЬNULL(ВТ_ДанныеОтпусков.ДатаОкончания, НЕОПРЕДЕЛЕНО) КАК ДатаОкончанияОтпуска,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_ПроцентОтРабот.ОбслуживаниеКлиента, 0) <> 0
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ВыполненныеРаботы
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата,) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПроцентОтРабот КАК ВТ_ПроцентОтРабот
		|		ПО ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник = ВТ_ПроцентОтРабот.Специалист
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеОтпусков КАК ВТ_ДанныеОтпусков
		|		ПО ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник = ВТ_ДанныеОтпусков.Сотрудник";
		
		
		Запрос.УстановитьПараметр("Дата", Объект.ПериодРегистрации);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		//Оклад
		СтрокаТЧ = Объект.НачисленияЗаработнойПлаты.Добавить();
		СтрокаТЧ.Сотрудник = Выборка.Сотрудник;
		СтрокаТЧ.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад;
		СтрокаТЧ.ДатаНачала = НачалоМесяца(Объект.ПериодРегистрации);
		СтрокаТЧ.ДатаОкончания = КонецМесяца(Объект.ПериодРегистрации);
		СтрокаТЧ.ГрафикРаботы = Объект.ГрафикРаботы;
		
		Если Выборка.ВыполненныеРаботы <> 0 Тогда
			СтрокаТЧ = Объект.НачисленияЗаработнойПлаты.Добавить();
			СтрокаТЧ.Сотрудник = Выборка.Сотрудник;
			СтрокаТЧ.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ПремияПроцентом;
			СтрокаТЧ.ДатаНачала = НачалоМесяца(Объект.ПериодРегистрации);
			СтрокаТЧ.ДатаОкончания = КонецМесяца(Объект.ПериодРегистрации);
			СтрокаТЧ.ГрафикРаботы = Объект.ГрафикРаботы;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ДатаНачалаОтпуска) Тогда
			
			СтрокаТЧ = Объект.НачисленияЗаработнойПлаты.Добавить();
			СтрокаТЧ.Сотрудник = Выборка.Сотрудник;
			СтрокаТЧ.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск;
			СтрокаТЧ.ГрафикРаботы = Объект.ГрафикРаботы;
			
			Если Месяц(Объект.ПериодРегистрации) = Месяц(Выборка.ДатаНачалаОтпуска) Тогда
				СтрокаТЧ.ДатаНачала = Выборка.ДатаНачалаОтпуска;
			Иначе
				СтрокаТЧ.ДатаНачала = НачалоМесяца(Объект.ПериодРегистрации);
			КонецЕсли;
			
			Если Месяц(Объект.ПериодРегистрации) = Месяц(Выборка.ДатаОкончанияОтпуска) Тогда
				СтрокаТЧ.ДатаОкончания = Выборка.ДатаОкончанияОтпуска;
			Иначе
				СтрокаТЧ.ДатаОкончания = КонецМесяца(Объект.ПериодРегистрации);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	


КонецПроцедуры

#КонецОбласти